#Область ПрограммныйИнтерфейс

// Возвращает признак автоматического преобразования ШтрихкодаBase64 в Штрихкод.
//  
Функция ПреобразованиеШтрихкодаBase64()  Экспорт
	
	Возврат Истина;
	
КонецФункции

// Переопределяемая процедура вызывается после открытия чека.
//
Процедура ПечатьЧекаПослеОткрытияЧека(ПараметрыВыполнения) Экспорт
	
	// Пример
	ПараметрыВыполнения.ПродолжитьПечать = Истина;
	ПараметрыВыполнения.ТекстОшибки = "Ошибка!";
	// Подпись чека ЕГАИС.
	АдресЧека   = "https://partners.v8.1c.ru/forum/forum/186/topics";
	ПодписьЧека = "20N00001CKO68OY4QYX3T1731224004002671B1IEHLWKNFXFO8FPMERND09WMB8FYV7";
	
	ПараметрыВыполнения.АдресЧека = АдресЧека;
	ПараметрыВыполнения.ПодписьЧека = ПодписьЧека;

КонецПроцедуры

// Переопределяемая процедура вызывается при ошибке печати чека.
//
Функция ПечатьЧекаПриОшибкеПечати(ПараметрыВыполнения) Экспорт
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
КонецПроцедуры

// Переопределяемая функция возвращает разрешение использовать несколько экземпляров одного типа оборудования.
//
Функция РазрешитьНесколькоЭкземпляровОдногоТипаОборудования() Экспорт
	
	Результат = Истина;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
