
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Штрихкод     = "2900000005686";
	УголПоворота = 0;
	ТипШтрихкодаЗнач = 1;
	УровеньКоррекцииQR = 1;
	КоличествоСтрокGS1Databar = 2;
	ВертикальноеВыравнивание  = 1;
	
	ШиринаШтрихкода = 300;
	ВысотаШтрихкода = 200;
	
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ТипШтрихкода);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.Штрихкод);
	
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.Масштабировать);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.СохранятьПропорции);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ПрозрачныйФон);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ГенерацияШтрихкодаКлиент.УстановитьКомпонентуПечатиШтрихкодов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДействиеСформировать(Команда)
	
	ВнешняяКомпонента = ГенерацияШтрихкодаКлиент.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Если ВнешняяКомпонента = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка подключения внешней компоненты печати штрихкода.'");
		Сообщить(ТекстСообщения);
	Иначе
		ВерсияКомпоненты = ВнешняяКомпонента.Версия;
	КонецЕсли;
	
	Изображение = ПоместитьВоВременноеХранилище(ПолучитьШтрихкод());;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьШтрихкод()
	
	//ИнформацияЭкрана = ПолучитьИнформациюЭкрановКлиента();
	//ВысотаШтрихкода = ИнформацияЭкрана[0].Высота / 2;
	//ШиринаШтрихкода = ИнформацияЭкрана[0].Ширина / 2;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина"            , ШиринаШтрихкода);
	ПараметрыШтрихкода.Вставить("Высота"            , ВысотаШтрихкода);
	ПараметрыШтрихкода.Вставить("ТипКода"           , ТипШтрихкодаЗнач);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст"   , Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта"      , 14);
	ПараметрыШтрихкода.Вставить("УголПоворота"      , Число(УголПоворота));
	ПараметрыШтрихкода.Вставить("Штрихкод"          , Штрихкод);
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон"     , ПрозрачныйФон);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR", УровеньКоррекцииQR);
	ПараметрыШтрихкода.Вставить("Масштабировать"           , Масштабировать);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции"       , СохранятьПропорции);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , ВертикальноеВыравнивание); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", КоличествоСтрокGS1Databar);
	Возврат ГенерацияШтрихкодаКлиент.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
КонецФункции

#КонецОбласти