
#Область ОбработчикиСобытийФормы  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Параметры.Свойство("Описание") Тогда
		SS_РаботаСФормами.ОтрисоватьФормуПоОписанию(ЭтаФорма, Параметры.Описание);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеФормыСписка" и Параметр = УникальныйИдентификатор Тогда
		SS_СлужебныйКлиентСервер.ОбновитьДанныеСписка(ЭтаФорма, Параметры.Действие);				
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы   


&НаКлиенте
Процедура ОбновитьСписок(Команда)

      SS_СлужебныйКлиентСервер.ОбновитьДанныеСписка(ЭтаФорма, Параметры.Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаШтрихкодаДокумента",ЭтаФорма);
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШтрихкода",ПараметрыФормы,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры



#КонецОбласти       

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте 
Процедура ПослеВводаШтрихкодаДокумента(Результат, ДополнительныеПараметры) Экспорт     
	
	Если ЗначениеЗаполнено(Результат) Тогда		
		SS_СлужебныйКлиентСервер.ОбработатьВВодШтрихкода(ЭтаФорма, Результат, "Поиск документа по штрихкоду");				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПротоПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда  		
		SS_СлужебныйКлиентСервер.ОбработатьСобытиеСписокДокументовВыбор(ЭтаФорма, Параметры.Действие, ТекДанные.Номер);		
	КонецЕсли;

КонецПроцедуры          


#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ПротоКоманда(Команда)
	
	SS_СлужебныйКлиентСервер.ОбработатьКомандуДействие(ЭтаФорма, Параметры.Действие, Параметры.Предмет, Команда.Имя);
	
КонецПроцедуры



#КонецОбласти


#КонецОбласти
