#Область ПрограммныйИнтерфейс

// Возвращает список доступных типов оборудования.
// 
// Возвращаемое значение:
//   Массив - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	// Устройство ввода
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода);
	// Конец Устройство ввода.
	
	// ККТ с передачей данных
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	// Конец ККТ с передачей данных.
	
	// Принтер чеков
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	// Конец принтер чеков.
	
	// Платежные cистемы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема);
	// Конец Платежные cистемы.
	
	// Считыватели RFID
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID);
	// Конец Считыватели RFID.    
	
	// Электронные весы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы);
	// Конец Электронные весы.        
	
	// Дисплеи покупателя
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ДисплеиПокупателя);
	// Конец Дисплеи покупателя.    
	
	Возврат СписокОборудования;
	
КонецФункции

// Обновить поставляемые драйверы в составе конфигурации
//                                   
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	// Мультиплатформенные драйвера
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ10X",   
		"АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x",
		"AddIn.ATOL_KKT_1C83_V10", 
		Ложь,
		"10.6.2.0");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ10XФФД12",   
		"АТОЛ:ККТ с передачей данных в ОФД 10.Х (ФФД 1.2)",
		"AddIn.ATOL_KKT_1C_V10", 
		Ложь);                           
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверШтрихМККТ54ФЗ4ФФД12NG",   
		"Штрих-М:ККТ с передачей данных в ОФД (ФФД 1.2) NG",
		"AddIn.ShtrihM_fr_drv_ng_V1", 
		Ложь,
		"0.1.3.126");                           
	// Конец ККТ с передачей данных.
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"Драйвер1СПринтерЧеков", 
		"1С:Принтер чеков",
		"AddIn.ReceiptPrinterNative", 
		Ложь,
		"3.1.4.6");
	// Конец Принтеры чеков
	
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1ССканерШтрихкода",
		"1С:Cканер штрихкода (NativeApi)",
		"AddIn.InputDevice",
		Ложь,
		"10.4.1.3");       
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы,
		"Драйвер1СЭлектронныеВесы",
		"1С:Электронные весы (NativeApi)",
		"AddIn.CheckoutScales",
		Ложь,
		"1.2.1.1");
		
	// Платежные cистемы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"Драйвер1СЭквайринговыеТерминалыСбербанк2х", 
		"1С:Эквайринговые терминалы Сбербанк 2.Х",
		"AddIn.SberAcquiringTerminal2",
		Ложь,
		"2.3.8.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверUCSEFTPOSЭквайринговыеТерминалы", 
		"UCS-AT:Эквайринговые терминалы",
		"AddIn.UcsAT",
		Ложь,
		"1.3.1");
	// Конец Платежные cистемы       
	
	// Дисплеи покупателя
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ДисплеиПокупателя,
		"Драйвер1СДисплейПокупателя", 
		"1С:Дисплей покупателя",
		"AddIn.CustomerDisplayEx",
		Ложь,
		"4.1.6.6");
	// Конец Дисплеи покупателя
	
#Если МобильноеПриложениеСервер Тогда
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверВерсияТККТ54ФЗ",
		"Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.VT_KKT_1CInt",
		Ложь,
		"1.0.3");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверШтрихМККТ54ФЗ",
		"Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.com_shtrih_jpos1c",
		Ложь,
		"1.19.1");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАЗУРККТ54ФЗФФД12",
		"АЗУР:ККТ с передачей данных в ОФД (ФФД 1.2)",
		"AddIn.com_azurpos_fz54_AzurPos",
		Ложь,
		"1.1.1.0");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверRightScanККТ54ФЗ",
		"RightScan:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.FNCore",
		Ложь,
		"1.23");
	// Конец ККТ с передачей данных.
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"ДрайверRightScanУстройствоПечати", 
		"RightScan:Устройство печати ТСД Urovo",
		"AddIn.RSPrinter",
		Ложь,
		"1.15");
	// Конец принтеров чеков
	
	// Устройство ввода
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1СУстройствоВвода", 
		"1С:Устройство ввода",
		"com.e1c.inputdevice",
		Истина,
		"1.0.1.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканкодСканерШтрихкода", 
		"СКАНКОД:Cканер штрихкода Chipherlab (Native)",
		"AddIn.ScancodeBarcodeScannerCPT",
		Ложь,
		"1.2.1.1");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверRightScanУстройстваВвода", 
		"RightScan:Устройства ввода данных ТСД Urovo",
		"AddIn.RSDriver",
		Ложь,
		"1.20");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверScanPortУстройстваВвода",
		"ScanPort:Устройства ввода данных",
		"AddIn.ScanportScanner",
		Ложь,
		"5.0.0.0");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканситиУстройстваВвода",
		"СКАН СИТИ:Устройства ввода данных",
		"AddIn.ScanCityNewlandBarcode",
		Ложь,
		"1.0.1.3");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверКлеверенсСканерШтрихкода",
		"Клеверенс:Драйвер ТСД для мобильной платформы 1С",
		"AddIn.CleverenceBarcodeScanner",
		Ложь,
		"1.1.0.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверАТОЛСканерШтрихкода",
		"АТОЛ:Устройства ввода данных",
		"AddIn.ru_atol_BarcodeServiceExtension",
		Ложь,
		"1.0.6.0");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверMERTECHСканерШтрихкода",
		"MERTECH:Сканер штрихкода ТСД",
		"AddIn.ru_mertech_AndroidScannerExtension",
		Ложь,
		"1.1.0.0");
	// Конец устройство ввода
	
	// Платежные cистемы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверInpasПлатежнаяСистема", 
		"ИНПАС:Эквайринг-терминал",
		"com.inpas.dualconnector1c",
		Истина,
		"1.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверIboxProПлатежнаяСистема", 
		"2Can:Сервис приема платежей",
		"iboxPro1C",
		Истина,
		"2.40");        
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверАЗУРПлатежнаяСистема", 
		"АЗУР:Платежная система",
		"AddIn.com_azurpos_payment_AzurPosPayment",
		Ложь,
		"1.0.2.1");    
	// Конец Платежные cистемы.
	
#КонецЕсли

КонецПроцедуры

// Обновление библиотеки в составе конфигурации.
//                                   
Процедура ОбновлениеБиблиотеки() Экспорт
	
	ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

// Возвращает флаг возможности добавления новых драйверов в справочник драйверов
//
Функция ВозможностьДобавленияНовыхДрайверов() Экспорт
	
	МожноДобавлятьНовыеДрайвера = Истина;
	Возврат МожноДобавлятьНовыеДрайвера;
	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным из текущего сеанса.
//  
// Возвращаемое значение:
//  Булево - В случае вызова в неразделенной конфигурации возвращает Истина.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает для каких типов идентификаторов будет заполняться тег 1162 (код товара).
//
// Параметры:
//  ТипыИдентификаторов - Массив - Типы идентификаторов, Массив значений  Перечисления.ТипыИдентификаторовТовараККТ.
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура КодТовараЗаполняетсяДляТиповИдентификаторов(ТипыИдентификаторов, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Возвращает, для каких типов товаров будет заполняться отраслевой реквизит.
//
// Параметры:
//  ТипыТоваров - Структура
//  * ИзделияИзНатуральногоМеха - Булево - Заполнения для изделия из натурального меха. 
//
Процедура ОтраслевойРеквизитЗаполняетсяДляТиповТоваров(ТипыТоваров) Экспорт
	
КонецПроцедуры

 // Ведется учет ИСМП в конфигурации
// Параметры:
//  УчетПродукцииИСМП - Булево - Ведется учет ИСМП в конфигурации 
//  СтандартнаяОбработка - Булево - Выполнение стандартной обработки
//
Процедура ВедетсяУчетПродукцииИСМП(УчетПродукцииИСМП, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Ведется объемно сортовой учет в конфигурации
// Параметры:
//  ОбъемноСортовойУчет - Булево - Ведется объемно сортовой учет в конфигурации 
//  СтандартнаяОбработка - Булево - Выполнение стандартной обработки
//
Процедура ВедетсяОбъемноСортовойУчет(ОбъемноСортовойУчет, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти     

#Область РаботаСЭлементомФормы

// Дополнительные переопределяемые действия с элементом формы 
// служит для учета специфики визуального отображения в зависимости от типа клиента.
//
Процедура ПодготовитьЭлементУправления(ЭлементУправления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
Процедура ЭкземплярОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ЭкземплярОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт

КонецПроцедуры

#КонецОбласти