 
#Область ОбработчикиСобытийЭлементовФормы   

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	ОписаниеОшибки = "";
	Если НЕ МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, "УстройствоВвода", ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры         


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОписаниеОшибки = "";
	Если НЕ МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, "УстройствоВвода", ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти
 
#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Ок(Команда)
	
	SS_СлужебныйКлиентСервер.ОбработатьВВодШтрихкода(ЭтаФорма, Штрихкод, "ВводШтрихкода");
	
КонецПроцедуры            


#КонецОбласти       

#Область СлужебныеПроцедурыИФункции     


&НаКлиенте
Процедура ЗакрытьФормуИВернутьШтрихкод(ВведенныйШтрихкод) Экспорт   

	Закрыть(ВведенныйШтрихкод)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Штрихкод" Или ИмяСобытия = "Barcode" Тогда
		
		SS_СлужебныйКлиентСервер.ОбработатьВВодШтрихкода(ЭтаФорма, Параметр, "ВводШтрихкода");
				
	КонецЕсли;
			
КонецПроцедуры


#КонецОбласти
