
#Область СлужебныйПрограммныйИнтерфейс 


Процедура УстановитьТекущееПодключение(База, ШтрихкодСотрудника = "") Экспорт  
	
	ПараметрыСеанса.ТекущееПодключение = База;  
	
	Если ШтрихкодСотрудника <> "" Тогда
		ПараметрыСеанса.ШтрихкодСотрудника = ШтрихкодСотрудника; 	
	КонецЕсли;
	
КонецПроцедуры   

Функция ВернутьТекущееПодключниеКбазе() Экспорт 
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("База", ПараметрыСеанса.ТекущееПодключение);   
	СтруктураВозврата.Вставить("ШтрихкодСотрудника", ПараметрыСеанса.ШтрихкодСотрудника);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
		|	ИнформационныеБазы.ИДТерминала КАК ИДТерминала,
		|	ИнформационныеБазы.ПарольТерминала КАК ПарольТерминала,
		|	ИнформационныеБазы.Сервер КАК Сервер
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Ссылка = &Ссылка";   
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураВозврата.База);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПараметрыПодключения = Новый Структура("ИмяБазы, Сервер, ИДТерминала, ПарольТерминала","","","","");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ВыборкаДетальныеЗаписи);		
	КонецЕсли;                                                                 
	
	СтруктураВозврата.Вставить("ПараметрыПодключения", ПараметрыПодключения);
	Возврат СтруктураВозврата;
	

	
КонецФункции

Процедура ОтключитьсяОтТекущейБазыБазы() Экспорт  
	
	ПараметрыСеанса.ТекущееПодключение = Справочники.ИнформационныеБазы.ПустаяСсылка();  	
	ПараметрыСеанса.ШтрихкодСотрудника = ""; 	
	
КонецПроцедуры


#КонецОбласти