
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Описание") Тогда
		SS_РаботаСФормами.ОтрисоватьФормуПоОписанию(ЭтаФорма, Параметры.Описание);	
	КонецЕсли;
	
КонецПроцедуры         

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеФормыДействия" и Параметр = УникальныйИдентификатор Тогда
		Оповестить("ОбновлениеФормыСписка", ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
		Закрыть();	
	ИначеЕсли ИмяСобытия = "Штрихкод" Или ИмяСобытия = "Barcode" Тогда	
		SS_СлужебныйКлиентСервер.ОбработатьВВодШтрихкода(ЭтаФорма, Параметр, Параметры.Действие);			
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
		
	ОписаниеОшибки = "";
	Если НЕ МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, "УстройствоВвода", ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры         

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОписаниеОшибки = "";
	Если НЕ МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, "УстройствоВвода", ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

 
#КонецОбласти    


#Область ПротоПроцедурыИФункции

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ПротоКоманда(Команда)	
	SS_СлужебныйКлиентСервер.ОбработатьКомандуДействие(ЭтаФорма, Параметры.Действие, Параметры.Предмет, Команда.Имя);	
КонецПроцедуры

&НаКлиенте
Процедура ок(Команда)
	SS_СлужебныйКлиентСервер.ОбработатьВВодШтрихкода(ЭтаФорма, Штрихкод, Параметры.Действие);
КонецПроцедуры


#КонецОбласти


#КонецОбласти

